In [1]:
import sqlalchemy as db
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

# Database Connection and Column Information

In [2]:
engine = db.create_engine('postgresql://postgres:Test14012022@localhost:5432/postgres')
connection = engine.connect()
metadata = db.MetaData()
cricketers = db.Table('cricketers', metadata, autoload=True, autoload_with=engine)
print(cricketers.columns.keys())
print(repr(metadata.tables['cricketers']))

['first_name', 'last_name', 'age', 'place_of_birth', 'country']
Table('cricketers', MetaData(), Column('first_name', VARCHAR(length=255), table=<cricketers>), Column('last_name', VARCHAR(length=255), table=<cricketers>), Column('age', INTEGER(), table=<cricketers>), Column('place_of_birth', VARCHAR(length=255), table=<cricketers>), Column('country', VARCHAR(length=255), table=<cricketers>), schema=None)

# Select Data
SELECT * FROM cricketers

In [3]:
query = db.select([cricketers])
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
df = pd.DataFrame(ResultSet)
df

  first_name   last_name  age place_of_birth      country
0    Shikhar      Dhawan   33          Delhi        India
1    Shikhar      Dhawan   33          Delhi        India
2   Jonathan       Trott   38       CapeTown  SouthAfrica
3     Kumara  Sangakkara   41         Matale     Srilanka
4      Virat       Kohli   30          Delhi        India
5      Rohit      Sharma   32         Nagpur        India

for large data, we can not read all of them at once, so we use fetchmany

In [4]:
flag = True
while flag:
    partial_results = ResultProxy.fetchmany(50)
    if not partial_results:
        flag = False
    # code
ResultProxy.close()

# Select Data Using Where
SELECT * FROM cricketers WHERE age > 35

In [5]:
query = db.select([cricketers]).where(cricketers.columns.age > 35)
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
df = pd.DataFrame(ResultSet)
df

  first_name   last_name  age place_of_birth      country
0   Jonathan       Trott   38       CapeTown  SouthAfrica
1     Kumara  Sangakkara   41         Matale     Srilanka

# Select Data Using In
SELECT place_of_birth, last_name FROM cricketers WHERE country IN ('Srilanka', 'SouthAfrica')

In [6]:
query = db.select([cricketers.columns.place_of_birth, cricketers.columns.last_name])\
    .where(cricketers.columns.country.in_(['Srilanka', 'SouthAfrica']))
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
df = pd.DataFrame(ResultSet)
df

  place_of_birth   last_name
0       CapeTown       Trott
1         Matale  Sangakkara

# Conditions Using And, Or, Not
SELECT * FROM cricketers WHERE country = 'India' AND NOT place_of_birth = 'Nagpur'

In [7]:
query = db.select([cricketers])\
    .where(db.and_(cricketers.columns.country == 'India', cricketers.columns.place_of_birth != 'Nagpur'))
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
df = pd.DataFrame(ResultSet)
df

  first_name last_name  age place_of_birth country
0    Shikhar    Dhawan   33          Delhi   India
1    Shikhar    Dhawan   33          Delhi   India
2      Virat     Kohli   30          Delhi   India

# Order By
SELECT * FROM cricketers ORDER BY age, last_name

In [8]:
query = db.select([cricketers]).order_by(db.desc(cricketers.columns.age), cricketers.columns.last_name)
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
df = pd.DataFrame(ResultSet)
df

  first_name   last_name  age place_of_birth      country
0     Kumara  Sangakkara   41         Matale     Srilanka
1   Jonathan       Trott   38       CapeTown  SouthAfrica
2    Shikhar      Dhawan   33          Delhi        India
3    Shikhar      Dhawan   33          Delhi        India
4      Rohit      Sharma   32         Nagpur        India
5      Virat       Kohli   30          Delhi        India

# Aggregations (sum, avg, max, etc.)
SELECT SUM(age) FROM cricketers

In [9]:
query = db.select([db.func.sum(cricketers.columns.age)])
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
df = pd.DataFrame(ResultSet)
df

   sum_1
0    207

# Group By
SELECT SUM(age) as AgeSum, place_of_birth FROM cricketers GROUP BY place_of_birth

In [10]:
query = db.select([db.func.sum(cricketers.columns.age).label('AgeSum'), cricketers.columns.place_of_birth])\
    .group_by(cricketers.columns.place_of_birth)
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
df = pd.DataFrame(ResultSet)
df

   AgeSum place_of_birth
0      96          Delhi
1      32         Nagpur
2      41         Matale
3      38       CapeTown

# Distinct
SELECT DISTINCT first_name FROM cricketers

In [11]:
query = db.select([cricketers.columns.first_name.distinct()])
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
df = pd.DataFrame(ResultSet)
df

  first_name
0    Shikhar
1      Rohit
2     Kumara
3   Jonathan
4      Virat

# Case, Else and Cast
SELECT sum(CASE WHEN (cricketers.place_of_birth = :place_of_birth_1) THEN cricketers.age ELSE :param_1 END) AS sum_1 FROM cricketers

In [12]:
cast = db.func.sum(db.case([(cricketers.columns.place_of_birth == 'Delhi', cricketers.columns.age)], else_=0))
query = db.select([cast])
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
df = pd.DataFrame(ResultSet)
df

   sum_1
0     96

SELECT CAST(sum(cricketers.age) AS FLOAT) AS sum_1 FROM cricketers

In [13]:
cast = db.cast(db.func.sum(cricketers.columns.age), db.Float)
query = db.select([cast])
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
df = pd.DataFrame(ResultSet)
print(df)

   sum_1
0  207.0

# Join

In [14]:
ODIStats = db.Table('odistats', metadata, autoload=True, autoload_with=engine)

Automatic Join<br>
SELECT cricketers.first_name, odistats.first_name AS first_name_1

In [15]:
query = db.select([cricketers.columns.first_name, ODIStats.columns.first_name])
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
df = pd.DataFrame(ResultSet)
df

   first_name first_name_1
0     Shikhar      Shikhar
1     Shikhar      Shikhar
2    Jonathan      Shikhar
3      Kumara      Shikhar
4       Virat      Shikhar
5       Rohit      Shikhar
6     Shikhar     Jonathan
7     Shikhar     Jonathan
8    Jonathan     Jonathan
9      Kumara     Jonathan
10      Virat     Jonathan
11      Rohit     Jonathan
12    Shikhar       Kumara
13    Shikhar       Kumara
14   Jonathan       Kumara
15     Kumara       Kumara
16      Virat       Kumara
17      Rohit       Kumara
18    Shikhar        Virat
19    Shikhar        Virat
20   Jonathan        Virat
21     Kumara        Virat
22      Virat        Virat
23      Rohit        Virat
24    Shikhar        Rohit
25    Shikhar        Rohit
26   Jonathan        Rohit
27     Kumara        Rohit
28      Virat        Rohit
29      Rohit        Rohit

Manual Join<br>
SELECT cricketers.first_name, cricketers.last_name, cricketers.age, cricketers.place_of_birth, cricketers.country, odistats.first_name AS first_name_1, odistats.matches, odistats.runs, odistats.avg, odistats.centuries, odistats.halfcenturies FROM cricketers JOIN odistats ON cricketers.first_name = odistats.first_name

In [16]:
query = db.select([cricketers, ODIStats])
query = query.select_from(cricketers.join(ODIStats, cricketers.columns.first_name == ODIStats.columns.first_name))
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
df = pd.DataFrame(ResultSet)
df

,first_name,last_name,age,place_of_birth,country,first_name_1,matches,runs,avg,centuries,halfcenturies
0,Shikhar,Dhawan,33,Delhi,India,Shikhar,133,5518,44.50,17,27
1,Shikhar,Dhawan,33,Delhi,India,Shikhar,133,5518,44.50,17,27
2,Jonathan,Trott,38,CapeTown,SouthAfrica,Jonathan,68,2819,51.25,4,22
3,Kumara,Sangakkara,41,Matale,Srilanka,Kumara,404,14234,41.99,25,93
4,Virat,Kohli,30,Delhi,India,Virat,239,11520,60.31,43,54
5,Rohit,Sharma,32,Nagpur,India,Rohit,218,8686,48.53,24,42

# Create Table and Insert Data
By passing the database which is not present, to the engine then sqlalchemy automatically creates a new table.

In [17]:
emp = db.Table('test', metadata,
               db.Column('Id', db.Integer()),
               db.Column('name', db.String(255), nullable=False),
               db.Column('salary', db.Float(), default=100.0),
               db.Column('active', db.Boolean(), default=True)
               )
metadata.create_all(engine)  # Creates the table

Inserting record one by one

In [18]:
query = db.insert(emp).values(Id=1, name='naveen', salary=60000.00, active=True)
connection.execute(query)

Inserting many records at ones

In [19]:
query = db.insert(emp)
values_list = [{'Id': '2', 'name': 'ram', 'salary': 80000, 'active': False},
               {'Id': '3', 'name': 'ramesh', 'salary': 70000, 'active': True}]
connection.execute(query, values_list)

In [20]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df

   Id    name   salary  active
0   1  naveen  60000.0    True
1   2     ram  80000.0   False
2   3  ramesh  70000.0    True

# Update Data

In [21]:
engine = db.create_engine('postgresql://postgres:Test14012022@localhost:5432/postgres')
connection = engine.connect()
metadata = db.MetaData()
emp = db.Table('test', metadata, autoload=True, autoload_with=engine)

In [22]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df

   Id    name   salary  active
0   1  naveen  60000.0    True
1   2     ram  80000.0   False
2   3  ramesh  70000.0    True

In [23]:
query = db.update(emp).values({'salary': 100000})
query = query.where(emp.columns.Id == 1)
print(query)
connection.execute(query)

UPDATE test SET salary=:salary WHERE test."Id" = :Id_1

In [24]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df

   Id    name    salary  active
0   2     ram   80000.0   False
1   3  ramesh   70000.0    True
2   1  naveen  100000.0    True

# Delete Date

In [25]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df

   Id    name    salary  active
0   2     ram   80000.0   False
1   3  ramesh   70000.0    True
2   1  naveen  100000.0    True

In [26]:
query = db.delete(emp)
query = query.where(emp.columns.salary < 100000)
connection.execute(query)

In [27]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df

   Id    name    salary  active
0   1  naveen  100000.0    True